src/Documents/ОперацияПоБонусномуСчету.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ОперацияПоБонусномуСчету</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.БонусныеСчета</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БонусныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БонусныеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецБонусногоСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Карты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Comment>Реализация</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.Реализация</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводНачальныхОстатков</v8:Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
						<v8:Type>cfg:DocumentRef.НарядЗаказ</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратОтПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>550</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/AccumulationRegisters/БонусныеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>БонусныеСчета</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>БонусныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БонусныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументНачисления</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Реализация</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводНачальныхОстатков</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
						<v8:Type>cfg:DocumentRef.ОперацияПоБонусномуСчету</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Documents/ОперацияПоБонусномуСчету/Ext/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции

#Область Проведение

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура УстановитьНачальныеДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ОперацияПоБонусномуСчету.Дата КАК Период,
	|	ОперацияПоБонусномуСчету.БонусныйСчет КАК БонусныйСчет,
	|	ОперацияПоБонусномуСчету.Ссылка КАК ДокументНачисления,
	|	ОперацияПоБонусномуСчету.Сумма КАК Сумма,
	|	ОперацияПоБонусномуСчету.Содержание КАК Содержание
	|ПОМЕСТИТЬ ВременнаяТаблицаНачислениеБонусов
	|ИЗ
	|	Документ.ОперацияПоБонусномуСчету КАК ОперацияПоБонусномуСчету
	|ГДЕ
	|	ОперацияПоБонусномуСчету.Ссылка = &Ссылка
	|	И ОперацияПоБонусномуСчету.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.НачислениеБонусныйСчет)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ОперацияПоБонусномуСчету.Дата КАК Период,
	|	ОперацияПоБонусномуСчету.БонусныйСчет КАК БонусныйСчет,
	|	ОперацияПоБонусномуСчету.Ссылка КАК ДокументНачисления,
	|	ОперацияПоБонусномуСчету.Сумма КАК Сумма,
	|	ОперацияПоБонусномуСчету.Содержание КАК Содержание
	|ПОМЕСТИТЬ ВременнаяТаблицаСписаниеБонусов
	|ИЗ
	|	Документ.ОперацияПоБонусномуСчету КАК ОперацияПоБонусномуСчету
	|ГДЕ
	|	ОперацияПоБонусномуСчету.Ссылка = &Ссылка
	|	И ОперацияПоБонусномуСчету.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.СписаниеБонусныйСчет)";
				   
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	СформироватьТаблицаБонусныеСчета(ДокументСсылка, СтруктураДополнительныеСвойства);
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаБонусныеСчета(ДокументСсылка, СтруктураДополнительныеСвойства)
	
	РегистрыНакопления.БонусныеСчета.СформироватьТаблицуБонусныеСчета(СтруктураДополнительныеСвойства);
	
	// Запрос = Новый Запрос;
	// Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	// Запрос.Текст =
	// "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	// |	ТаблицаБонусныеСчета.Период КАК Период,
	// |	ТаблицаБонусныеСчета.ВидДвижения КАК ВидДвижения,
	// |	ТаблицаБонусныеСчета.БонусныйСчет КАК БонусныйСчет,
	// |	ТаблицаБонусныеСчета.ДокументНачисления КАК ДокументНачисления,
	// |	СУММА(ТаблицаБонусныеСчета.Сумма) КАК Сумма
	// |ИЗ
	// |	ВременнаяТаблицаНачислениеБонусов КАК ТаблицаБонусныеСчета
	// |ГДЕ
	// |	ТаблицаБонусныеСчета.Сумма > 0
	// |
	// |СГРУППИРОВАТЬ ПО
	// |	ТаблицаБонусныеСчета.Период,
	// |	ТаблицаБонусныеСчета.ВидДвижения,
	// |	ТаблицаБонусныеСчета.БонусныйСчет,
	// |	ТаблицаБонусныеСчета.ДокументНачисления
	// |
	// |ОБЪЕДИНИТЬ ВСЕ
	// |
	// |ВЫБРАТЬ ПЕРВЫЕ 0
	// |	ДАТАВРЕМЯ(1, 1, 1),
	// |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	// |	ЗНАЧЕНИЕ(Справочник.БонусныеСчета.ПустаяСсылка),
	// |	ОперацияПоБонусномуСчету.Ссылка,
	// |	0
	// |ИЗ
	// |	Документ.ОперацияПоБонусномуСчету КАК ОперацияПоБонусномуСчету
	// |ГДЕ
	// |	ЛОЖЬ
	// |
	// |ОБЪЕДИНИТЬ ВСЕ
	// |
	// |ВЫБРАТЬ ПЕРВЫЕ 0
	// |	ДАТАВРЕМЯ(1, 1, 1),
	// |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	// |	ЗНАЧЕНИЕ(Справочник.БонусныеСчета.ПустаяСсылка),
	// |	Посещение.Ссылка,
	// |	0
	// |ИЗ
	// |	Документ.Посещение КАК Посещение
	// |ГДЕ
	// |	ЛОЖЬ
	// |
	// |ОБЪЕДИНИТЬ ВСЕ
	// |
	// |ВЫБРАТЬ ПЕРВЫЕ 0
	// |	ДАТАВРЕМЯ(1, 1, 1),
	// |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	// |	ЗНАЧЕНИЕ(Справочник.БонусныеСчета.ПустаяСсылка),
	// |	ПоступлениеДенежныхСредств.Ссылка,
	// |	0
	// |ИЗ
	// |	Документ.ПоступлениеДенежныхСредств КАК ПоступлениеДенежныхСредств
	// |ГДЕ
	// |	ЛОЖЬ
	// |
	// |ОБЪЕДИНИТЬ ВСЕ
	// |
	// |ВЫБРАТЬ ПЕРВЫЕ 0
	// |	ДАТАВРЕМЯ(1, 1, 1),
	// |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	// |	ЗНАЧЕНИЕ(Справочник.БонусныеСчета.ПустаяСсылка),
	// |	ВводНачальныхОстатков.Ссылка,
	// |	0
	// |ИЗ
	// |	Документ.ВводНачальныхОстатков КАК ВводНачальныхОстатков
	// |ГДЕ
	// |	ЛОЖЬ
	// |
	// |ОБЪЕДИНИТЬ ВСЕ
	// |
	// |ВЫБРАТЬ ПЕРВЫЕ 0
	// |	ДАТАВРЕМЯ(1, 1, 1),
	// |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	// |	ЗНАЧЕНИЕ(Справочник.БонусныеСчета.ПустаяСсылка),
	// |	Реализация.Ссылка,
	// |	0
	// |ИЗ
	// |	Документ.Реализация КАК Реализация
	// |ГДЕ
	// |	ЛОЖЬ
	// |;
	// |
	// |////////////////////////////////////////////////////////////////////////////////
	// |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	// |	ВременнаяТаблицаСписаниеБонусов.Период КАК Период,
	// |	ВременнаяТаблицаСписаниеБонусов.ВидДвижения КАК ВидДвижения,
	// |	ВременнаяТаблицаСписаниеБонусов.БонусныйСчет КАК БонусныйСчет,
	// |	СУММА(ВременнаяТаблицаСписаниеБонусов.Сумма) КАК Сумма
	// |ИЗ
	// |	ВременнаяТаблицаСписаниеБонусов КАК ВременнаяТаблицаСписаниеБонусов
	// |
	// |СГРУППИРОВАТЬ ПО
	// |	ВременнаяТаблицаСписаниеБонусов.Период,
	// |	ВременнаяТаблицаСписаниеБонусов.ВидДвижения,
	// |	ВременнаяТаблицаСписаниеБонусов.БонусныйСчет
	// |;
	// |
	// |////////////////////////////////////////////////////////////////////////////////
	// |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	// |	БонусныеСчетаОстатки.БонусныйСчет КАК БонусныйСчет,
	// |	БонусныеСчетаОстатки.ДокументНачисления КАК ДокументНачисления,
	// |	БонусныеСчетаОстатки.СуммаОстаток КАК СуммаОстаток
	// |ИЗ
	// |	РегистрНакопления.БонусныеСчета.Остатки(
	// |			&ПериодОстатков,
	// |			БонусныйСчет В
	// |				(ВЫБРАТЬ
	// |					ВременнаяТаблицаСписаниеБонусов.БонусныйСчет
	// |				ИЗ
	// |					ВременнаяТаблицаСписаниеБонусов)) КАК БонусныеСчетаОстатки
	// |ГДЕ
	// |	БонусныеСчетаОстатки.СуммаОстаток > 0
	// |
	// |УПОРЯДОЧИТЬ ПО
	// |	БонусныеСчетаОстатки.ДокументНачисления.Дата";
	//
	// Если СтруктураДополнительныеСвойства.Свойство("ДатаРасчетаОстатковНаБонусныхСчетах") 
	//	И ЗначениеЗаполнено(СтруктураДополнительныеСвойства.ДатаРасчетаОстатковНаБонусныхСчетах) Тогда 
	//	Запрос.УстановитьПараметр("ПериодОстатков", СтруктураДополнительныеСвойства.ДатаРасчетаОстатковНаБонусныхСчетах);
	// Иначе
	//	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ПериодОстатков", "");
	// КонецЕсли;         
	//
	// РезультатЗапроса     = Запрос.ВыполнитьПакет();
	// ТаблицаБонусныеСчета = РезультатЗапроса[0].Выгрузить();
	//
	// ТаблицаОплатаБонуснымиСчетами = РезультатЗапроса[1].Выгрузить();
	// ОстатокНаБонусныхСчетах       = РезультатЗапроса[2].Выгрузить();
	//
	// Для Каждого СтрокаТЗОплата Из ТаблицаОплатаБонуснымиСчетами Цикл
	//	
	//	ОстатокНаБонусномСчете = ОстатокНаБонусныхСчетах.НайтиСтроки(Новый Структура("БонусныйСчет", СтрокаТЗОплата.БонусныйСчет));
	//	Для Каждого СтрокаТЗОстаток Из ОстатокНаБонусномСчете Цикл
	//		
	//		СуммаОплатаБонусамиПоПартии     = ?(СтрокаТЗОстаток.СуммаОстаток > СтрокаТЗОплата.Сумма, СтрокаТЗОплата.Сумма, СтрокаТЗОстаток.СуммаОстаток);
	//		НоваяСтрока                     = ТаблицаБонусныеСчета.Добавить();
	//		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗОплата);
	//		
	//		НоваяСтрока.ДокументНачисления = СтрокаТЗОстаток.ДокументНачисления;
	//		НоваяСтрока.Сумма              = СуммаОплатаБонусамиПоПартии;
	//		СтрокаТЗОплата.Сумма           = СтрокаТЗОплата.Сумма - СуммаОплатаБонусамиПоПартии;
	//		СтрокаТЗОстаток.СуммаОстаток   = СтрокаТЗОстаток.СуммаОстаток - СуммаОплатаБонусамиПоПартии;			
	//		
	//		Если СтрокаТЗОплата.Сумма = 0 Тогда
	//			Прервать;
	//		КонецЕсли;
	//		
	//	КонецЦикла;
	//	
	// КонецЦикла;
	//
	//// если что-то есть не списанное по партиям, списать без документа основания.
	// Если ТаблицаОплатаБонуснымиСчетами.Итог("Сумма") > 0 Тогда
	//	Для Каждого СтрокаТЗОплата Из ТаблицаОплатаБонуснымиСчетами Цикл
	//		Если СтрокаТЗОплата.Сумма = 0 Тогда
	//			Продолжить;
	//		КонецЕсли;
	//		
	//		ЗаполнитьЗначенияСвойств(ТаблицаБонусныеСчета.Добавить(), СтрокаТЗОплата);
	//	КонецЦикла;
	// КонецЕсли;   	
	//
	// СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаБонусныеСчета", ТаблицаБонусныеСчета);	
	//
КонецПроцедуры  // СформироватьТаблицаБонусныеСчета()

#КонецОбласти

#КонецОбласти
